src/InformationRegisters/ОчередьОбновленияИндекса/ОчередьОбновленияИндекса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОбновленияИндекса</name>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОчередьОбновленияИндекса/ManagerModule.bsl
////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОбъектВОчередьОбновленияПоисковогоИндекса(Объект, ОписаниеОшибки = "", КоличествоПопыток = 0) Экспорт
	
	Запись = РегистрыСведений.ОчередьОбновленияИндекса.СоздатьМенеджерЗаписи();
	
	Запись.Объект = Объект;
	Запись.Дата   = ТекущаяДата();
	Запись.ОписаниеОшибки = ОписаниеОшибки;	
	Запись.КоличествоПопыток = Запись.КоличествоПопыток + КоличествоПопыток;
	
	Запись.Записать();
	
КонецПроцедуры //ДобавитьОбъектВОчередьОбновленияПоисковогоИндекса

Процедура УдалитьОбъектИзОчередиОбновленияПоисковогоИндекса(Объект) Экспорт
	
	Запись = РегистрыСведений.ОчередьОбновленияИндекса.СоздатьМенеджерЗаписи();
	Запись.Объект = Объект;
	Запись.Прочитать();	
	Запись.Удалить();
	
КонецПроцедуры //ДобавитьОбъектВОчередьОбновленияПоисковогоИндекса

#КонецОбласти
